levizh/zephyr/ext/hal/xhsc/hc32_ddl/hc32f460/drivers/src/hc32_ll_tmrb.c
/**
 *******************************************************************************
 * @file  hc32_ll_tmrb.c
 * @brief This file provides firmware functions to manage the TMRB(TimerB).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
   2023-09-30       CDT             Delete union in stc_tmrb_init_t structure [-HC32F120,HC32M120-]
                                    Split register BCSTR,modify function relate to BCSTR [-HC32F120,HC32M120-]
                                    Refine code due to some of member type of struct stc_tmrb_init_t is modified [-HC32F120,HC32M120-]
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2024, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_tmrb.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_TMRB TMRB
 * @brief TMRB Driver Library
 * @{
 */

#if (LL_TMRB_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TMRB_Local_Macros TMRB Local Macros
 * @{
 */

/* TMRB maximum channel */
#if defined (HC32M423)
#define TMRB_CH_MAX                         (6UL)
#define TMRB_CAPT_CH_MAX                    (4UL)
#elif defined (CD32Z16X)
#define TMRB_CH_MAX                         (4UL)
#define TMRB_CAPT_CH_MAX                    (4UL)
#elif defined (HC32F115) || defined (HC32F120) || defined (HC32F160) || defined (HC32M120)
#define TMRB_CH_MAX                         (1UL)
#define TMRB_CAPT_CH_MAX                    (1UL)
#elif defined (HC32F165)
#define TMRB_CH_MAX                         (2UL)
#define TMRB_CAPT_CH_MAX                    (2UL)
#endif

/**
 * @defgroup TMRB_Mask TMRB Mask
 * @{
 */
#define TMRB_CNT_FLAG_MASK                  (TMRB_FLAG_OVF | TMRB_FLAG_UDF)
#define TMRB_CNT_INT_MASK                   (TMRB_INT_OVF  | TMRB_INT_UDF)
#if defined (HC32M423)
#define TMRB_CMP_FLAG_MASK                  (TMRB_FLAG_CMP1 | TMRB_FLAG_CMP2 | TMRB_FLAG_CMP3 | TMRB_FLAG_CMP4 | \
                                             TMRB_FLAG_CMP5 | TMRB_FLAG_CMP6)
#define TMRB_CMP_INT_MASK                   (TMRB_INT_CMP1 | TMRB_INT_CMP2 | TMRB_INT_CMP3 | TMRB_INT_CMP4 | \
                                             TMRB_INT_CMP5 | TMRB_INT_CMP6)
#elif defined (CD32Z16X)
#define TMRB_CMP_FLAG_MASK                  (TMRB_FLAG_CMP1 | TMRB_FLAG_CMP2 | TMRB_FLAG_CMP3 | TMRB_FLAG_CMP4)
#define TMRB_CMP_INT_MASK                   (TMRB_INT_CMP1 | TMRB_INT_CMP2 | TMRB_INT_CMP3 | TMRB_INT_CMP4)
#elif defined (HC32F115) || defined (HC32F120) || defined (HC32F160) || defined (HC32M120)
#define TMRB_CMP_FLAG_MASK                  (TMRB_FLAG_CMP1)
#define TMRB_CMP_INT_MASK                   (TMRB_INT_CMP1)
#elif defined (HC32F165)
#define TMRB_CMP_FLAG_MASK                  (TMRB_FLAG_CMP1 | TMRB_FLAG_CMP2)
#define TMRB_CMP_INT_MASK                   (TMRB_INT_CMP1 | TMRB_INT_CMP2)
#endif
/**
 * @}
 */

/**
 * @defgroup TMRB_Calculate_Register_Address TMRB Calculate Register Address
 * @{
 */
#if defined (HC32M423) || defined (CD32Z16X) || defined (HC32F165)
#define TMRB_BCONR_ADDR(__UNIT__, __CH__)   (__IO uint16_t*)((uint32_t)(&((__UNIT__)->BCONR1)) + (((__CH__) >> 1UL) << 3UL))
#define TMRB_CMPAR_ADDR(__UNIT__, __CH__)   (__IO uint16_t*)((uint32_t)(&((__UNIT__)->CMPAR1)) + ((__CH__) << 2UL))
#define TMRB_CCONR_ADDR(__UNIT__, __CH__)   (__IO uint16_t*)((uint32_t)(&((__UNIT__)->CCONR1)) + ((__CH__) << 2UL))
#define TMRB_PCONR_ADDR(__UNIT__, __CH__)   (__IO uint16_t*)((uint32_t)(&((__UNIT__)->PCONR1)) + ((__CH__) << 2UL))
#elif defined (HC32F115) || defined (HC32F120) || defined (HC32F160) || defined (HC32M120)
#define TMRB_CMPAR_ADDR(__UNIT__, __CH__)   (__IO uint16_t*)((uint32_t)(&((__UNIT__)->CMPAR)))
#define TMRB_CCONR_ADDR(__UNIT__, __CH__)   (__IO uint16_t*)((uint32_t)(&((__UNIT__)->CCONR)))
#define TMRB_PCONR_ADDR(__UNIT__, __CH__)   (__IO uint16_t*)((uint32_t)(&((__UNIT__)->PCONR)))
#endif
/**
 * @}
 */

/**
 * @defgroup TMRB_Check_Parameters_Validity TMRB Check Parameters Validity
 * @{
 */
#if defined (HC32M423)
#define IS_TMRB_UNIT(x)                         ((x) == CM_TMRB)

#define IS_TMRB_CH(x)                                                          \
(   ((x) == TMRB_CH1)                           ||                             \
    ((x) == TMRB_CH2)                           ||                             \
    ((x) == TMRB_CH3)                           ||                             \
    ((x) == TMRB_CH4)                           ||                             \
    ((x) == TMRB_CH5)                           ||                             \
    ((x) == TMRB_CH6))

#define IS_TMRB_CAPT_CH(x)                                                     \
(   ((x) == TMRB_CH1)                           ||                             \
    ((x) == TMRB_CH2)                           ||                             \
    ((x) == TMRB_CH3)                           ||                             \
    ((x) == TMRB_CH4))

#define IS_TMRB_BUF_CH(x)                                                      \
(   ((x) == TMRB_CH1)                           ||                             \
    ((x) == TMRB_CH3)                           ||                             \
    ((x) == TMRB_CH5))

#define IS_TMRB_CMP_BUF_COND(x)                                                \
(   ((x) == TMRB_BUF_COND_INVD)                 ||                             \
    ((x) == TMRB_BUF_COND_PEAK)                 ||                             \
    ((x) == TMRB_BUF_COND_VALLEY)               ||                             \
    ((x) == TMRB_BUF_COND_PEAK_VALLEY))
#elif defined (CD32Z16X)
#define IS_TMRB_UNIT(x)                                                        \
(   ((x) == CM_TMRB_1)                          ||                             \
    ((x) == CM_TMRB_2)                          ||                             \
    ((x) == CM_TMRB_3))

