levizh/zephyr/ext/hal/xhsc/hc32_ddl/hc32f460/drivers/src/hc32_ll_tmrb.c
#define IS_TMRB_CH(x)                                                          \
(   ((x) == TMRB_CH1)                           ||                             \
    ((x) == TMRB_CH2)                           ||                             \
    ((x) == TMRB_CH3)                           ||                             \
    ((x) == TMRB_CH4))

#define IS_TMRB_CAPT_CH(x)                                                     \
(   ((x) == TMRB_CH1)                           ||                             \
    ((x) == TMRB_CH2)                           ||                             \
    ((x) == TMRB_CH3)                           ||                             \
    ((x) == TMRB_CH4))

#define IS_TMRB_BUF_CH(x)                                                      \
(   ((x) == TMRB_CH1)                           ||                             \
    ((x) == TMRB_CH3))

#define IS_TMRB_CMP_BUF_COND(x)                                                \
(   ((x) == TMRB_BUF_COND_INVD)                 ||                             \
    ((x) == TMRB_BUF_COND_PEAK)                 ||                             \
    ((x) == TMRB_BUF_COND_VALLEY)               ||                             \
    ((x) == TMRB_BUF_COND_PEAK_VALLEY))
#elif defined (HC32F115) || defined (HC32F120) || defined (HC32F160)
#define IS_TMRB_UNIT(x)                                                        \
(   ((x) == CM_TMRB_1)                          ||                             \
    ((x) == CM_TMRB_2)                          ||                             \
    ((x) == CM_TMRB_3)                          ||                             \
    ((x) == CM_TMRB_4)                          ||                             \
    ((x) == CM_TMRB_5)                          ||                             \
    ((x) == CM_TMRB_6)                          ||                             \
    ((x) == CM_TMRB_7)                          ||                             \
    ((x) == CM_TMRB_8))

#define IS_TMRB_SYNC_UNIT(x)                                                   \
(   ((x) == CM_TMRB_2)                          ||                             \
    ((x) == CM_TMRB_4)                          ||                             \
    ((x) == CM_TMRB_6)                          ||                             \
    ((x) == CM_TMRB_8))

#define IS_TMRB_CH(x)                           ((x) == TMRB_CH1)
#define IS_TMRB_CAPT_CH(x)                      ((x) == TMRB_CH1)
#elif defined (HC32M120)
#define IS_TMRB_UNIT(x)                                                        \
(   ((x) == CM_TMRB_1)                          ||                             \
    ((x) == CM_TMRB_2)                          ||                             \
    ((x) == CM_TMRB_3)                          ||                             \
    ((x) == CM_TMRB_4))

#define IS_TMRB_SYNC_UNIT(x)                                                   \
(   ((x) == CM_TMRB_2)                          ||                             \
    ((x) == CM_TMRB_4))

#define IS_TMRB_CH(x)                           ((x) == TMRB_CH1)
#define IS_TMRB_CAPT_CH(x)                      ((x) == TMRB_CH1)
#elif defined (HC32F165)
#define IS_TMRB_UNIT(x)                                                        \
(   ((x) == CM_TMRB_1)                          ||                             \
    ((x) == CM_TMRB_2)                          ||                             \
    ((x) == CM_TMRB_3)                          ||                             \
    ((x) == CM_TMRB_4)                          ||                             \
    ((x) == CM_TMRB_5)                          ||                             \
    ((x) == CM_TMRB_6))

#define IS_TMRB_CH(x)                                                          \
(   ((x) == TMRB_CH1)                           ||                             \
    ((x) == TMRB_CH2))

#define IS_TMRB_CAPT_CH(x)                                                     \
(   ((x) == TMRB_CH1)                           ||                             \
    ((x) == TMRB_CH2))

#define IS_TMRB_BUF_CH(x)                       ((x) == TMRB_CH1)

#define IS_TMRB_CMP_BUF_COND(x)                                                \
(   ((x) == TMRB_BUF_COND_INVD)                 ||                             \
    ((x) == TMRB_BUF_COND_PEAK)                 ||                             \
    ((x) == TMRB_BUF_COND_VALLEY)               ||                             \
    ((x) == TMRB_BUF_COND_PEAK_VALLEY))

#define IS_TMRB_SYNC_UNIT(x)                                                   \
(   ((x) == CM_TMRB_2)                          ||                             \
    ((x) == CM_TMRB_4)                          ||                             \
    ((x) == CM_TMRB_6))
#endif

#define IS_TMRB_CNT_SRC(x)                                                     \
(   ((x) == TMRB_CNT_SRC_HW)                    ||                             \
    ((x) == TMRB_CNT_SRC_SW))

#define IS_TMRB_CLK_DIV(x)                                                     \
(   ((x) == TMRB_CLK_DIV1)                      ||                             \
    ((x) == TMRB_CLK_DIV2)                      ||                             \
    ((x) == TMRB_CLK_DIV4)                      ||                             \
    ((x) == TMRB_CLK_DIV8)                      ||                             \
    ((x) == TMRB_CLK_DIV16)                     ||                             \
    ((x) == TMRB_CLK_DIV32)                     ||                             \
    ((x) == TMRB_CLK_DIV64)                     ||                             \
    ((x) == TMRB_CLK_DIV128)                    ||                             \
    ((x) == TMRB_CLK_DIV256)                    ||                             \
    ((x) == TMRB_CLK_DIV512)                    ||                             \
    ((x) == TMRB_CLK_DIV1024))

#define IS_TMRB_CNT_MD(x)                                                      \
(   ((x) == TMRB_MD_SAWTOOTH)                   ||                             \
    ((x) == TMRB_MD_TRIANGLE))

#define IS_TMRB_CNT_DIR(x)                                                     \
(   ((x) == TMRB_DIR_UP)                        ||                             \
    ((x) == TMRB_DIR_DOWN))

#define IS_TMRB_CNT_RELOAD(x)                                                  \
(   ((x) == TMRB_CNT_RELOAD_DISABLE)            ||                             \
    ((x) == TMRB_CNT_RELOAD_ENABLE))

#define IS_TMRB_START_COND(x)                                                  \
(   ((x) != 0U)                                 &&                             \
    (((x) | TMRB_START_COND_ALL) == TMRB_START_COND_ALL))

#define IS_TMRB_STOP_COND(x)                                                   \
(   ((x) != 0U)                                 &&                             \
    (((x) | TMRB_STOP_COND_ALL) == TMRB_STOP_COND_ALL))

