levizh/zephyr/ext/hal/xhsc/hc32_ddl/hc32f460/drivers/src/hc32_ll_tmrb.c
#define IS_TMRB_CLR_COND(x)                                                    \
(   ((x) != 0U)                                 &&                             \
    (((x) | TMRB_CLR_COND_ALL) == TMRB_CLR_COND_ALL))

#define IS_TMRB_CNT_UP_COND(x)                                                 \
(   ((x) != 0U)                                 &&                             \
    (((x) | TMRB_CNT_UP_COND_ALL) == TMRB_CNT_UP_COND_ALL))

#define IS_TMRB_CNT_DOWN_COND(x)                                               \
(   ((x) != 0U)                                 &&                             \
    (((x) | TMRB_CNT_DOWN_COND_ALL) == TMRB_CNT_DOWN_COND_ALL))

#define IS_TMRB_HW_CNT_UP_COND(x)               (((x) | TMRB_CNT_UP_COND_ALL) == TMRB_CNT_UP_COND_ALL)

#define IS_TMRB_HW_CNT_DOWN_COND(x)             (((x) | TMRB_CNT_DOWN_COND_ALL) == TMRB_CNT_DOWN_COND_ALL)

#define IS_TMRB_PWM_CNT_STAT(x)                                                \
(   ((x) == TMRB_PWM_CNT_START)                 ||                             \
    ((x) == TMRB_PWM_CNT_STOP)                  ||                             \
    ((x) == TMRB_PWM_CNT_MATCH)                 ||                             \
    ((x) == TMRB_PWM_CNT_PERIOD))

#define IS_TMRB_PWM_START_STOP_POLARITY(x)                                     \
(   ((x) == TMRB_PWM_LOW)                       ||                             \
    ((x) == TMRB_PWM_HIGH)                      ||                             \
    ((x) == TMRB_PWM_HOLD))

#define IS_TMRB_PWM_MATCH_POLARITY(x)                                          \
(   ((x) == TMRB_PWM_LOW)                       ||                             \
    ((x) == TMRB_PWM_HIGH)                      ||                             \
    ((x) == TMRB_PWM_HOLD)                      ||                             \
    ((x) == TMRB_PWM_INVT))

#define IS_TMRB_PWM_POLARITY(state, polarity)                                  \
(   ((((state) == TMRB_PWM_CNT_START) || ((state) == TMRB_PWM_CNT_STOP))    && \
     (IS_TMRB_PWM_START_STOP_POLARITY(polarity)))                           || \
    ((((state) == TMRB_PWM_CNT_MATCH) || ((state) == TMRB_PWM_CNT_PERIOD))  && \
    (IS_TMRB_PWM_MATCH_POLARITY(polarity))))

#define IS_TMRB_PWM_FORCE_POLARITY(x)                                          \
(   ((x) == TMRB_PWM_FORCE_INVD)                ||                             \
    ((x) == TMRB_PWM_FORCE_LOW)                 ||                             \
    ((x) == TMRB_PWM_FORCE_HIGH))

#define IS_TMRB_FUNC_MD(x)                                                     \
(   ((x) == TMRB_FUNC_CMP)                      ||                             \
    ((x) == TMRB_FUNC_CAPT))

#define IS_TMRB_FILTER_CLK_DIV(x)                                              \
(   ((x) == TMRB_FILTER_CLK_DIV1)               ||                             \
    ((x) == TMRB_FILTER_CLK_DIV4)               ||                             \
    ((x) == TMRB_FILTER_CLK_DIV16)              ||                             \
    ((x) == TMRB_FILTER_CLK_DIV64))

#define IS_TMRB_CAPT_COND(x)                                                   \
(   ((x) != 0U)                                 &&                             \
    (((x) | TMRB_CAPT_COND_ALL) == TMRB_CAPT_COND_ALL))

#define IS_TMRB_FLAG(x)                                                        \
(   ((x) != 0U)                                 &&                             \
    (((x) | TMRB_FLAG_ALL) == TMRB_FLAG_ALL))

#define IS_TMRB_INT(x)                                                         \
(   ((x) != 0U)                                 &&                             \
    (((x) | TMRB_INT_ALL) == TMRB_INT_ALL))

#define IS_TMRB_EVT(x)                                                         \
(   ((x) != 0U)                                 &&                             \
    (((x) | TMRB_EVT_ALL) == TMRB_EVT_ALL))
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup TMRB_Global_Functions TMRB Global Functions
 * @{
 */

/**
 * @brief  De-Initialize TMRB unit base function.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @retval None
 */
void TMRB_DeInit(CM_TMRB_TypeDef *TMRBx)
{
    uint32_t u32Count;
#if defined (HC32M423) || defined (CD32Z16X) || defined (HC32F165)
    __IO uint16_t *BCONR;
#endif
    __IO uint16_t *PCONR;
    __IO uint16_t *CMPAR;
    __IO uint16_t *CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));

    /* Configures the registers to reset value. */
    WRITE_REG8(TMRBx->BCSTRL, 0x02U);
    WRITE_REG8(TMRBx->BCSTRH, 0x00U);
    WRITE_REG16(TMRBx->CNTER, 0x0000U);
    WRITE_REG16(TMRBx->PERAR, 0xFFFFU);
    WRITE_REG16(TMRBx->HCONR, 0x0000U);
    WRITE_REG16(TMRBx->HCUPR, 0x0000U);
    WRITE_REG16(TMRBx->HCDOR, 0x0000U);
    for (u32Count = 0U; u32Count < TMRB_CH_MAX; u32Count++) {
#if defined (HC32M423) || defined (CD32Z16X) || defined (HC32F165)
        if (0U == (u32Count % 2U)) {
            BCONR = TMRB_BCONR_ADDR(TMRBx, u32Count);
            WRITE_REG16(*BCONR, 0x0000U);
        }
#endif
        PCONR = TMRB_PCONR_ADDR(TMRBx, u32Count);
        WRITE_REG16(*PCONR, 0x0000U);
        CMPAR = TMRB_CMPAR_ADDR(TMRBx, u32Count);
        WRITE_REG16(*CMPAR, 0xFFFFU);
    }
    for (u32Count = 0U; u32Count < TMRB_CAPT_CH_MAX; u32Count++) {
        CCONR = TMRB_CCONR_ADDR(TMRBx, u32Count);
        WRITE_REG16(*CCONR, 0x0000U);
    }
    WRITE_REG16(TMRBx->ICONR, 0x0000U);
    WRITE_REG16(TMRBx->ECONR, 0x0000U);
    WRITE_REG16(TMRBx->STFLR, 0x0000U);
}

/**
 * @brief  Initialize TMRB base function.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] pstcTmrbInit            Pointer to a @ref stc_tmrb_init_t structure.
 * @retval int32_t:
 *           - LL_OK: Initialize success
 *           - LL_ERR_INVD_PARAM: pstcTmrbInit is NULL
 */
int32_t TMRB_Init(CM_TMRB_TypeDef *TMRBx, const stc_tmrb_init_t *pstcTmrbInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcTmrbInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
        DDL_ASSERT(IS_TMRB_CNT_SRC(pstcTmrbInit->u8CountSrc));
        DDL_ASSERT(IS_TMRB_CNT_RELOAD(pstcTmrbInit->u8CountReload));

        if (TMRB_CNT_SRC_SW == pstcTmrbInit->u8CountSrc) {
            DDL_ASSERT(IS_TMRB_CLK_DIV(pstcTmrbInit->sw_count.u8ClockDiv));
            DDL_ASSERT(IS_TMRB_CNT_MD(pstcTmrbInit->sw_count.u8CountMode));
            DDL_ASSERT(IS_TMRB_CNT_DIR(pstcTmrbInit->sw_count.u8CountDir));

            MODIFY_REG8(TMRBx->BCSTRL, (TMRB_BCSTRL_CKDIV | TMRB_BCSTRL_MODE | TMRB_BCSTRL_DIR),
                        (pstcTmrbInit->sw_count.u8ClockDiv | pstcTmrbInit->sw_count.u8CountMode |
                         pstcTmrbInit->sw_count.u8CountDir));
            MODIFY_REG8(TMRBx->BCSTRH, TMRB_BCSTRH_OVSTP, pstcTmrbInit->u8CountReload);
        } else {
            DDL_ASSERT(IS_TMRB_HW_CNT_UP_COND(pstcTmrbInit->hw_count.u16CountUpCond));
            DDL_ASSERT(IS_TMRB_HW_CNT_DOWN_COND(pstcTmrbInit->hw_count.u16CountDownCond));

