levizh/zephyr/ext/hal/xhsc/hc32_ddl/hc32f460/drivers/src/hc32_ll_tmrb.c
            MODIFY_REG8(TMRBx->BCSTRH, TMRB_BCSTRH_OVSTP, pstcTmrbInit->u8CountReload);
            WRITE_REG16(TMRBx->HCUPR, pstcTmrbInit->hw_count.u16CountUpCond);
            WRITE_REG16(TMRBx->HCDOR, pstcTmrbInit->hw_count.u16CountDownCond);
        }
        WRITE_REG16(TMRBx->PERAR, pstcTmrbInit->u16PeriodValue);
        WRITE_REG16(TMRBx->CNTER, 0U);
    }

    return i32Ret;
}

/**
 * @brief  Set the fields of structure stc_tmrb_init_t to default values.
 * @param  [out] pstcTmrbInit           Pointer to a @ref stc_tmrb_init_t structure.
 * @retval int32_t:
 *           - LL_OK: Initialize success
 *           - LL_ERR_INVD_PARAM: pstcTmrbInit is NULL
 */
int32_t TMRB_StructInit(stc_tmrb_init_t *pstcTmrbInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcTmrbInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcTmrbInit->u8CountSrc           = TMRB_CNT_SRC_SW;
        pstcTmrbInit->sw_count.u8ClockDiv  = TMRB_CLK_DIV1;
        pstcTmrbInit->sw_count.u8CountMode = TMRB_MD_SAWTOOTH;
        pstcTmrbInit->sw_count.u8CountDir  = TMRB_DIR_DOWN;
        pstcTmrbInit->hw_count.u16CountUpCond   = TMRB_CNT_UP_COND_INVD;
        pstcTmrbInit->hw_count.u16CountDownCond = TMRB_CNT_DOWN_COND_INVD;
        pstcTmrbInit->u16PeriodValue        = 0xFFFFU;
        pstcTmrbInit->u8CountReload        = TMRB_CNT_RELOAD_ENABLE;
    }

    return i32Ret;
}

/**
 * @brief  Start TMRB counter.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @retval None
 */
void TMRB_Start(CM_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));

    SET_REG8_BIT(TMRBx->BCSTRL, TMRB_BCSTRL_START);
}

/**
 * @brief  Stop TMRB counter.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @retval None
 */
void TMRB_Stop(CM_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));

    CLR_REG8_BIT(TMRBx->BCSTRL, TMRB_BCSTRL_START);
}

/**
 * @brief  Set the TMRB counter count value.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u16Value                Counter count value (between Min_Data=0 and Max_Data=0xFFFF)
 * @retval None
 */
void TMRB_SetCountValue(CM_TMRB_TypeDef *TMRBx, uint16_t u16Value)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));

    WRITE_REG16(TMRBx->CNTER, u16Value);
}

/**
 * @brief  Get the TMRB counter count value.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @retval uint16_t                     Counter count value
 */
uint16_t TMRB_GetCountValue(const CM_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));

    return READ_REG16(TMRBx->CNTER);
}

/**
 * @brief  Set TMRB counter period value.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u16Value                Counter period value (between Min_Data=0 and Max_Data=0xFFFF)
 * @retval None
 */
void TMRB_SetPeriodValue(CM_TMRB_TypeDef *TMRBx, uint16_t u16Value)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));

    WRITE_REG16(TMRBx->PERAR, u16Value);
}

/**
 * @brief  Get TMRB counter period value.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @retval uint16_t                     Counter period value
 */
uint16_t TMRB_GetPeriodValue(const CM_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));

    return READ_REG16(TMRBx->PERAR);
}

/**
 * @brief  Set TMRB compare register value.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u32Ch                   TMRB channel
 *         This parameter can be one of the following values:
 *           @arg @ref TMRB_Channel
 * @param  [in] u16Value                Compare value (between Min_Data=0 and Max_Data=0xFFFF)
 * @retval None
 */
void TMRB_SetCompareValue(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16Value)
{
    __IO uint16_t *CMPAR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CH(u32Ch));

    CMPAR = TMRB_CMPAR_ADDR(TMRBx, u32Ch);
    WRITE_REG16(*CMPAR, u16Value);
}

/**
 * @brief  Get TMRB compare register value.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u32Ch                   TMRB channel
 *         This parameter can be one of the following values:
 *           @arg @ref TMRB_Channel
 * @retval uint16_t                     Compare value
 */
uint16_t TMRB_GetCompareValue(const CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch)
{
    __I uint16_t *CMPAR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CH(u32Ch));

    CMPAR = TMRB_CMPAR_ADDR(TMRBx, u32Ch);
    return READ_REG16(*CMPAR);
}

/**
 * @brief  Enable or disable the specified hardware count up condition of TMRB.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u16Cond                 TMRB hardware up counter condition
 *         This parameter can be any combination value of the following values:
 *           @arg @ref TMRB_Count_Up_Condition
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRB_HWCountUpCondCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16Cond, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CNT_UP_COND(u16Cond));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        SET_REG16_BIT(TMRBx->HCUPR, u16Cond);
    } else {
        CLR_REG16_BIT(TMRBx->HCUPR, u16Cond);
    }
}

/**
 * @brief  Enable or disable the specified hardware count down condition of TMRB.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u16Cond                 TMRB hardware down counter condition
 *         This parameter can be any combination value of the following values:
 *           @arg @ref TMRB_Count_Down_Condition
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRB_HWCountDownCondCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16Cond, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CNT_DOWN_COND(u16Cond));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        SET_REG16_BIT(TMRBx->HCDOR, u16Cond);
    } else {
        CLR_REG16_BIT(TMRBx->HCDOR, u16Cond);
    }
}

/**
 * @brief  Enable or disable the specified hardware start condition of TMRB.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u16Cond                 TMRB hardware start counter condition
 *         This parameter can be any combination value of the following values:
 *           @arg @ref TMRB_Start_Condition
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRB_HWStartCondCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16Cond, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_START_COND(u16Cond));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        SET_REG16_BIT(TMRBx->HCONR, u16Cond);
    } else {
        CLR_REG16_BIT(TMRBx->HCONR, u16Cond);
    }
}

/**
 * @brief  Enable or disable the specified hardware stop condition of TMRB.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u16Cond                 TMRB hardware start counter condition
 *         This parameter can be any combination value of the following values:
 *           @arg @ref TMRB_Stop_Condition
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRB_HWStopCondCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16Cond, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_STOP_COND(u16Cond));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        SET_REG16_BIT(TMRBx->HCONR, u16Cond);
    } else {
        CLR_REG16_BIT(TMRBx->HCONR, u16Cond);
    }
}

/**
 * @brief  Enable or disable the specified hardware clear condition of TMRB.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u16Cond                 TMRB hardware start counter condition
 *         This parameter can be any combination value of the following values:
 *           @arg @ref TMRB_Clear_Condition
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRB_HWClearCondCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16Cond, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CLR_COND(u16Cond));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        SET_REG16_BIT(TMRBx->HCONR, u16Cond);
    } else {
        CLR_REG16_BIT(TMRBx->HCONR, u16Cond);
    }
}

/**
 * @brief  Enable or disable the specified hardware capture condition of TMRB.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u32Ch                   TMRB compare channel
 *         This parameter can be one of the following values:
 *           @arg @ref TMRB_Channel
 * @param  [in] u16Cond                 TMRB hardware capture condition
 *         This parameter can be any combination value of the following values:
 *           @arg @ref TMRB_Capture_Condition
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRB_HWCaptureCondCmd(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16Cond, en_functional_state_t enNewState)
{
    __IO uint16_t *CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CAPT_CH(u32Ch));
    DDL_ASSERT(IS_TMRB_CAPT_COND(u16Cond));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

