levizh/zephyr/ext/hal/xhsc/hc32_ddl/hc32f460/drivers/src/hc32_ll_tmrb.c
    CCONR = TMRB_CCONR_ADDR(TMRBx, u32Ch);
    if (ENABLE == enNewState) {
        SET_REG16_BIT(*CCONR, u16Cond);
    } else {
        CLR_REG16_BIT(*CCONR, u16Cond);
    }
}

/**
 * @brief  Set TMRB clock division.
 * @note   The CLK division function is valid when clock source is HCLK/PCLK.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u8Div                   TMRB clock division
 *         This parameter can be one of the following values:
 *           @arg TMRB_CLK_DIV1:        CLK
 *           @arg TMRB_CLK_DIV2:        CLK/2
 *           @arg TMRB_CLK_DIV4:        CLK/4
 *           @arg TMRB_CLK_DIV8:        CLK/8
 *           @arg TMRB_CLK_DIV16:       CLK/16
 *           @arg TMRB_CLK_DIV32:       CLK/32
 *           @arg TMRB_CLK_DIV64:       CLK/64
 *           @arg TMRB_CLK_DIV128:      CLK/128
 *           @arg TMRB_CLK_DIV256:      CLK/256
 *           @arg TMRB_CLK_DIV512:      CLK/512
 *           @arg TMRB_CLK_DIV1024:     CLK/1024
 * @retval None
 */
void TMRB_SetClockDiv(CM_TMRB_TypeDef *TMRBx, uint8_t u8Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CLK_DIV(u8Div));

    MODIFY_REG8(TMRBx->BCSTRL, TMRB_BCSTRL_CKDIV, u8Div);
}

/**
 * @brief  Set the TMRB count mode.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u8Mode                  The TMRB count mode
 *         This parameter can be one of the following values:
 *           @arg TMRB_MD_SAWTOOTH:     Sawtooth wave mode
 *           @arg TMRB_MD_TRIANGLE:     Triangle wave mode
 * @retval None
 */
void TMRB_SetCountMode(CM_TMRB_TypeDef *TMRBx, uint8_t u8Mode)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CNT_MD(u8Mode));

    MODIFY_REG8(TMRBx->BCSTRL, TMRB_BCSTRL_MODE, u8Mode);
}

/**
 * @brief  Set the TMRB count direction.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u8Dir                   The TMRB count direction
 *         This parameter can be one of the following values:
 *           @arg TMRB_DIR_DOWN:        Count down
 *           @arg TMRB_DIR_UP:          Count up
 * @retval None
 */
void TMRB_SetCountDir(CM_TMRB_TypeDef *TMRBx, uint8_t u8Dir)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CNT_DIR(u8Dir));

    MODIFY_REG8(TMRBx->BCSTRL, TMRB_BCSTRL_DIR, u8Dir);
}

/**
 * @brief  Get the TMRB count direction.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @retval uint8_t                      Count direction
 *           - TMRB_DIR_DOWN:           Count down
 *           - TMRB_DIR_UP:             Count up
 */
uint8_t TMRB_GetCountDir(const CM_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));

    return READ_REG8_BIT(TMRBx->BCSTRL, TMRB_BCSTRL_DIR);
}

/**
 * @brief  Set TMRB function mode.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u32Ch                   TMRB compare channel
 *         This parameter can be one of the following values:
 *           @arg @ref TMRB_Channel
 * @param  [in] u16Func                 Function mode
 *         This parameter can be one of the following values:
 *           @arg TMRB_FUNC_CMP:        Compare output function
 *           @arg TMRB_FUNC_CAPT:       Capture input function
 * @retval None
 */
void TMRB_SetFunc(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16Func)
{
    __IO uint16_t *CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CAPT_CH(u32Ch));
    DDL_ASSERT(IS_TMRB_FUNC_MD(u16Func));

    CCONR = TMRB_CCONR_ADDR(TMRBx, u32Ch);
    MODIFY_REG16(*CCONR, TMRB_CCONR_CAPMD, u16Func);
}

/**
 * @brief  Enable or disable TMRB reload function.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRB_CountReloadCmd(CM_TMRB_TypeDef *TMRBx, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        CLR_REG8_BIT(TMRBx->BCSTRH, TMRB_BCSTRH_OVSTP);
    } else {
        SET_REG8_BIT(TMRBx->BCSTRH, TMRB_BCSTRH_OVSTP);
    }
}

#if defined (HC32F115) || defined (HC32F120) || defined (HC32F160) || defined (HC32M120) || defined (HC32F165)
/**
 * @brief  Enable or disable TMRB sync start.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
           This parameter can be one of the following values:
 *           @arg CM_TMRB_x:            TMRB unit instance
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRB_SyncStartCmd(CM_TMRB_TypeDef *TMRBx, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_SYNC_UNIT(TMRBx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        SET_REG8_BIT(TMRBx->BCSTRL, TMRB_BCSTRL_SYNST);
    } else {
        CLR_REG8_BIT(TMRBx->BCSTRL, TMRB_BCSTRL_SYNST);
    }
}
#endif

/**
 * @brief  Set TMRB input capture noise filter clock division.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u32Ch                   TMRB compare channel
 *         This parameter can be one of the following values:
 *           @arg @ref TMRB_Channel
 * @param  [in] u16Div                  TMRB input capture filter clock division
 *         This parameter can be one of the following values:
 *           @arg TMRB_FILTER_CLK_DIV1:     CLK
 *           @arg TMRB_FILTER_CLK_DIV4:     CLK/4
 *           @arg TMRB_FILTER_CLK_DIV16:    CLK/16
 *           @arg TMRB_FILTER_CLK_DIV64:    CLK/64
 * @retval None
 */
void TMRB_SetFilterClockDiv(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16Div)
{
    __IO uint16_t *CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CAPT_CH(u32Ch));
    DDL_ASSERT(IS_TMRB_FILTER_CLK_DIV(u16Div));

