levizh/zephyr/ext/hal/xhsc/hc32_ddl/hc32f460/drivers/src/hc32_ll_tmrb.c
    CCONR = TMRB_CCONR_ADDR(TMRBx, u32Ch);
    MODIFY_REG16(*CCONR, TMRB_CCONR_NOFICKCP, u16Div);
}

/**
 * @brief  Enable or disable the TMRB input capture noise filter function.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u32Ch                   TMRB compare channel
 *         This parameter can be one of the following values:
 *           @arg @ref TMRB_Channel
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRB_FilterCmd(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, en_functional_state_t enNewState)
{
    __IO uint16_t *CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CAPT_CH(u32Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    CCONR = TMRB_CCONR_ADDR(TMRBx, u32Ch);
    if (ENABLE == enNewState) {
        SET_REG16_BIT(*CCONR, TMRB_CCONR_NOFIENCP);
    } else {
        CLR_REG16_BIT(*CCONR, TMRB_CCONR_NOFIENCP);
    }
}

/**
 * @brief  De-Initialize the TMRB PWM.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u32Ch                   TMRB channel
 *         This parameter can be one of the following values:
 *           @arg @ref TMRB_Channel
 * @retval None
 */
void TMRB_PWM_DeInit(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch)
{
#if defined (HC32M423) || defined (CD32Z16X) || defined (HC32F165)
    __IO uint16_t *BCONR;
#endif
    __IO uint16_t *PCONR;
    __IO uint16_t *CMPAR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CH(u32Ch));

    /* Configures the registers to reset value. */
#if defined (HC32M423) || defined (CD32Z16X) || defined (HC32F165)
    if (IS_TMRB_BUF_CH(u32Ch)) {
        BCONR = TMRB_BCONR_ADDR(TMRBx, u32Ch);
        WRITE_REG16(*BCONR, 0x0000U);
    }
#endif
    PCONR = TMRB_PCONR_ADDR(TMRBx, u32Ch);
    WRITE_REG16(*PCONR, 0x0000U);
    CMPAR = TMRB_CMPAR_ADDR(TMRBx, u32Ch);
    WRITE_REG16(*CMPAR, 0xFFFFU);
    CLR_REG16_BIT(TMRBx->ICONR, (1UL << u32Ch));
    CLR_REG16_BIT(TMRBx->ECONR, (1UL << u32Ch));
    CLR_REG16_BIT(TMRBx->STFLR, (1UL << u32Ch));
}

/**
 * @brief  Initialize TMRB PWM function.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u32Ch                   TMRB channel
 *         This parameter can be one of the following values:
 *           @arg @ref TMRB_Channel
 * @param  [in] pstcTmrbPwmInit         Pointer to a @ref stc_tmrb_pwm_init_t.
 * @retval int32_t:
 *           - LL_OK: Initialize success
 *           - LL_ERR_INVD_PARAM: pstcTmrbPwmInit is NULL
 */
int32_t TMRB_PWM_Init(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, const stc_tmrb_pwm_init_t *pstcTmrbPwmInit)
{
    __IO uint16_t *PCONR;
    __IO uint16_t *CMPAR;
    __IO uint16_t *CCONR;
    int32_t i32Ret = LL_OK;

    if (NULL == pstcTmrbPwmInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
        DDL_ASSERT(IS_TMRB_CH(u32Ch));
        DDL_ASSERT(IS_TMRB_PWM_START_STOP_POLARITY(pstcTmrbPwmInit->u16StartPolarity));
        DDL_ASSERT(IS_TMRB_PWM_START_STOP_POLARITY(pstcTmrbPwmInit->u16StopPolarity));
        DDL_ASSERT(IS_TMRB_PWM_MATCH_POLARITY(pstcTmrbPwmInit->u16CompareMatchPolarity));
        DDL_ASSERT(IS_TMRB_PWM_MATCH_POLARITY(pstcTmrbPwmInit->u16PeriodMatchPolarity));

        CMPAR = TMRB_CMPAR_ADDR(TMRBx, u32Ch);
        WRITE_REG16(*CMPAR, pstcTmrbPwmInit->u16CompareValue);
        PCONR = TMRB_PCONR_ADDR(TMRBx, u32Ch);
        MODIFY_REG16(*PCONR, (TMRB_PCONR_STAC | TMRB_PCONR_STPC | TMRB_PCONR_CMPC | TMRB_PCONR_PERC),
                     ((uint16_t)(pstcTmrbPwmInit->u16StartPolarity        << TMRB_PCONR_STAC_POS) | \
                      (uint16_t)(pstcTmrbPwmInit->u16StopPolarity         << TMRB_PCONR_STPC_POS) | \
                      (uint16_t)(pstcTmrbPwmInit->u16CompareMatchPolarity << TMRB_PCONR_CMPC_POS) | \
                      (uint16_t)(pstcTmrbPwmInit->u16PeriodMatchPolarity  << TMRB_PCONR_PERC_POS)));
        /* Set TMRB compare output function mode */
        if (IS_TMRB_CAPT_CH(u32Ch)) {
            CCONR = TMRB_CCONR_ADDR(TMRBx, u32Ch);
            CLR_REG16_BIT(*CCONR, TMRB_CCONR_CAPMD);
        }
    }

    return i32Ret;
}

/**
 * @brief  Set the fields of structure stc_tmrb_pwm_init_t to default values.
 * @param  [out] pstcTmrbPwmInit            Pointer to a @ref stc_tmrb_pwm_init_t structure.
 * @retval int32_t:
 *           - LL_OK: Initialize success
 *           - LL_ERR_INVD_PARAM: pstcTmrbPwmInit is NULL
 */
int32_t TMRB_PWM_StructInit(stc_tmrb_pwm_init_t *pstcTmrbPwmInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcTmrbPwmInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcTmrbPwmInit->u16CompareValue         = 0xFFFFU;
        pstcTmrbPwmInit->u16StartPolarity        = TMRB_PWM_LOW;
        pstcTmrbPwmInit->u16StopPolarity         = TMRB_PWM_LOW;
        pstcTmrbPwmInit->u16CompareMatchPolarity = TMRB_PWM_LOW;
        pstcTmrbPwmInit->u16PeriodMatchPolarity  = TMRB_PWM_LOW;
    }

    return i32Ret;
}

/**
 * @brief  Set TIM_<t>_PWMn port output polarity.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u32Ch                   TMRB channel
 *         This parameter can be one of the following values:
 *           @arg @ref TMRB_Channel
 * @param  [in] u16CountState           TMRB count state
 *         This parameter can be one of the following values:
 *           @arg TMRB_PWM_CNT_START:   The TMRB start count
 *           @arg TMRB_PWM_CNT_STOP:    The TMRB stop count
 *           @arg TMRB_PWM_CNT_MATCH:   The TMRB compare match
 *           @arg TMRB_PWM_CNT_PERIOD:  The TMRB period match
 * @param  [in] u16Polarity             TMRB TIM_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TMRB_PWM_LOW:         TIM_<t>_PWMn output low level
 *           @arg TMRB_PWM_HIGH:        TIM_<t>_PWMn output high level
 *           @arg TMRB_PWM_HOLD:        TIM_<t>_PWMn output hold level
 *           @arg TMRB_PWM_INVT:        TIM_<t>_PWMn output inverted level
 * @retval None
 */
void TMRB_PWM_SetPolarity(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16CountState, uint16_t u16Polarity)
{
    __IO uint16_t *PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CH(u32Ch));
    DDL_ASSERT(IS_TMRB_PWM_POLARITY(u16CountState, u16Polarity));

    PCONR = TMRB_PCONR_ADDR(TMRBx, u32Ch);
    MODIFY_REG16(*PCONR, ((uint16_t)TMRB_PCONR_STAC << u16CountState), ((uint16_t)u16Polarity << u16CountState));
}

/**
 * @brief  Set TIM_<t>_PWMn port force output polarity.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u32Ch                   TMRB channel
 *         This parameter can be one of the following values:
 *           @arg @ref TMRB_Channel
 * @param  [in] u16Polarity             TMRB TIM_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TMRB_PWM_FORCE_INVD:  Invalid
 *           @arg TMRB_PWM_FORCE_LOW:   Force TIM_<t>_PWMn output low level
 *           @arg TMRB_PWM_FORCE_HIGH:  Force TIM_<t>_PWMn force output high level
 * @retval None
 */
void TMRB_PWM_SetForcePolarity(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16Polarity)
{
    __IO uint16_t *PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CH(u32Ch));
    DDL_ASSERT(IS_TMRB_PWM_FORCE_POLARITY(u16Polarity));

    PCONR = TMRB_PCONR_ADDR(TMRBx, u32Ch);
    MODIFY_REG16(*PCONR, TMRB_PCONR_FORC, u16Polarity);
}

/**
 * @brief  Enable or disable the TMRB PWM TIM_<t>_PWMn port function.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u32Ch                   TMRB channel
 *         This parameter can be one of the following values:
 *           @arg @ref TMRB_Channel
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRB_PWM_OutputCmd(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, en_functional_state_t enNewState)
{
    __IO uint16_t *PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_CH(u32Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    PCONR = TMRB_PCONR_ADDR(TMRBx, u32Ch);
    if (ENABLE == enNewState) {
        SET_REG16_BIT(*PCONR, TMRB_PCONR_OUTEN);
    } else {
        CLR_REG16_BIT(*PCONR, TMRB_PCONR_OUTEN);
    }
}

#if defined (HC32M423) || defined (CD32Z16X) || defined (HC32F165)
/**
 * @brief  Set TMRB triangle wave buffer mode.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u32Ch                   TMRB channel
 *         This parameter can be one of the following values:
 *           @arg @ref TMRB_Channel     TMRB channel 1,3,..
 * @param  [in] u16BufCond              The buffer transfer condition
 *         This parameter can be one of the following values:
 *           @arg TMRB_BUF_COND_INVD:           Don't transfer buffer value
 *           @arg TMRB_BUF_COND_PEAK:           Transfer buffer value when TMRB count peak
 *           @arg TMRB_BUF_COND_VALLEY:         Transfer buffer value when TMRB count valley
 *           @arg TMRB_BUF_COND_PEAK_VALLEY:    Transfer buffer value when TMRB count peak or valley
 * @retval None
 */
void TMRB_SetCompareBufCond(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, uint16_t u16BufCond)
{
    __IO uint16_t *BCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_BUF_CH(u32Ch));
    DDL_ASSERT(IS_TMRB_CMP_BUF_COND(u16BufCond));

