levizh/zephyr/ext/hal/xhsc/hc32_ddl/hc32f460/drivers/src/hc32_ll_tmrb.c
    BCONR = TMRB_BCONR_ADDR(TMRBx, u32Ch);
    MODIFY_REG16(*BCONR, (TMRB_BCONR_BSE0 | TMRB_BCONR_BSE1), u16BufCond);
}

/**
 * @brief  Enable or disable the specified channel buffer function of TMRB.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u32Ch                   TMRB channel
 *         This parameter can be one of the following values:
 *           @arg @ref TMRB_Channel     TMRB channel 1,3,..
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRB_CompareBufCmd(CM_TMRB_TypeDef *TMRBx, uint32_t u32Ch, en_functional_state_t enNewState)
{
    __IO uint16_t *BCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_BUF_CH(u32Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    BCONR = TMRB_BCONR_ADDR(TMRBx, u32Ch);
    if (ENABLE == enNewState) {
        SET_REG16_BIT(*BCONR, TMRB_BCONR_BEN);
    } else {
        CLR_REG16_BIT(*BCONR, TMRB_BCONR_BEN);
    }
}
#endif

/**
 * @brief  Enable or disable the specified TMRB interrupt.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u16IntType              TMRB interrupt type
 *         This parameter can be any combination value of the following values:
 *           @arg @ref TMRB_Interrupt
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRB_IntCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16IntType, en_functional_state_t enNewState)
{
    const uint8_t u8CountIntType = (uint8_t)((u16IntType & TMRB_CNT_INT_MASK) >> 8U);
    const uint16_t u16CmpIntType = (u16IntType & TMRB_CMP_INT_MASK);

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_INT(u16IntType));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        SET_REG8_BIT(TMRBx->BCSTRH, u8CountIntType);
        SET_REG16_BIT(TMRBx->ICONR, u16CmpIntType);
    } else {
        CLR_REG8_BIT(TMRBx->BCSTRH, u8CountIntType);
        CLR_REG16_BIT(TMRBx->ICONR, u16CmpIntType);
    }
}

/**
 * @brief  Enable or disable the specified compare channel event of TMRB.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u16EventType            TMRB event
 *         This parameter can be any combination value of the following values:
 *           @arg @ref TMRB_Event
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void TMRB_EventCmd(CM_TMRB_TypeDef *TMRBx, uint16_t u16EventType, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_EVT(u16EventType));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (ENABLE == enNewState) {
        SET_REG16_BIT(TMRBx->ECONR, u16EventType);
    } else {
        CLR_REG16_BIT(TMRBx->ECONR, u16EventType);
    }
}

/**
 * @brief  Get TMRB flag status.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u16Flag                 TMRB flag type
 *         This parameter can be any combination value of the following values:
 *           @arg @ref TMRB_Flag
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t TMRB_GetStatus(const CM_TMRB_TypeDef *TMRBx, uint16_t u16Flag)
{
    en_flag_status_t enCntStatus = RESET;
    en_flag_status_t enCmpStatus = RESET;
    const uint8_t u8CountFlag = (uint8_t)((u16Flag & TMRB_CNT_FLAG_MASK) >> 8U);
    const uint16_t u16CmpFlag = (u16Flag & TMRB_CMP_FLAG_MASK);

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_FLAG(u16Flag));

    if (0U != READ_REG8_BIT(TMRBx->BCSTRH, u8CountFlag)) {
        enCntStatus = SET;
    }
    if (0U != READ_REG16_BIT(TMRBx->STFLR, u16CmpFlag)) {
        enCmpStatus = SET;
    }

    return ((SET == enCntStatus) || (SET == enCmpStatus)) ? SET : RESET;
}

/**
 * @brief  Clear TMRB flag.
 * @param  [in] TMRBx                   Pointer to TMRB unit instance
 *         This parameter can be one of the following values:
 *           @arg CM_TMRB or CM_TMRB_x: TMRB unit instance
 * @param  [in] u16Flag                 TMRB flag type
 *         This parameter can be any combination value of the following values:
 *           @arg @ref TMRB_Flag
 * @retval None
 */
void TMRB_ClearStatus(CM_TMRB_TypeDef *TMRBx, uint16_t u16Flag)
{
    uint16_t u16FlagTemp;

    /* Check parameters */
    DDL_ASSERT(IS_TMRB_UNIT(TMRBx));
    DDL_ASSERT(IS_TMRB_FLAG(u16Flag));

    u16FlagTemp = u16Flag & TMRB_CNT_FLAG_MASK;
    if (0U != u16FlagTemp) {
        CLR_REG8_BIT(TMRBx->BCSTRH, (uint8_t)(u16FlagTemp >> 8U));
    }
    u16FlagTemp = u16Flag & TMRB_CMP_FLAG_MASK;
    if (0U != u16FlagTemp) {
        CLR_REG16_BIT(TMRBx->STFLR, u16FlagTemp);
    }
}

/**
 * @}
 */

#endif /* LL_TMRB_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
